[
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev77.3~policy~microsoft_edge~startup_restoreonstartup",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev77.3~policy~microsoft_edge~startup_restoreonstartup_restoreonstartup",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_policy_config_microsoft_edgev77.3~policy~microsoft_edge~startup_restoreonstartup_restoreonstartup_6"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_policy_config_microsoft_edgev77.3~policy~microsoft_edge~startup_restoreonstartup_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~startup_homepagelocation",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~startup_homepagelocation_homepagelocation",
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "https://contoso.sharepoint.com/",
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                }
              }
            ],
            "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~startup_homepagelocation_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~startup_restoreonstartupurls",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~startup_restoreonstartupurls_restoreonstartupurlsdesc",
                "settingInstanceTemplateReference": null,
                "simpleSettingCollectionValue": [
                  {
                    "settingValueTemplateReference": null,
                    "value": "https://contoso.sharepoint.com/",
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                  }
                ],
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance"
              }
            ],
            "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~startup_restoreonstartupurls_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-30T14:47:53.9558476Z",
    "settingCount": 3,
    "name": "Default Web Pages",
    "id": "1ff6047e-29c5-46cd-935e-26446f01d3d8",
    "description": "",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-30T14:42:58.4884901Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowintrusionpreventionsystem",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_defender_allowintrusionpreventionsystem_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:01:55.5484588Z",
    "settingCount": 1,
    "name": "Defender Configuration",
    "id": "2982fd9a-e505-4622-a75e-eca4437b0276",
    "description": "Microsoft Defender comprehensive security configuration",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:01:55.5484588Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_useraccountcontrol_switchtothesecuredesktopwhenpromptingforelevation_0"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:10:00.736523Z",
    "settingCount": 1,
    "name": "Disable UAC for Quickassist",
    "id": "a8f8db08-0c6a-44bc-a144-0c661c63b846",
    "description": "Disable UAC secure desktop prompt for QuickAssist",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:10:00.736523Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_updatev95~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_targetchannelmicrosoftedge",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_updatev95~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_targetchannelmicrosoftedge_part_targetchannel",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_policy_config_updatev95~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_targetchannelmicrosoftedge_part_targetchannel_stable"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_policy_config_updatev95~policy~cat_edgeupdate~cat_applications~cat_microsoftedge_pol_targetchannelmicrosoftedge_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedge_pol_updatepolicymicrosoftedge",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedge_pol_updatepolicymicrosoftedge_part_updatepolicy",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedge_pol_updatepolicymicrosoftedge_part_updatepolicy_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications~cat_microsoftedge_pol_updatepolicymicrosoftedge_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications_pol_defaultupdatepolicy",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications_pol_defaultupdatepolicy_part_updatepolicy",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications_pol_defaultupdatepolicy_part_updatepolicy_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_applications_pol_defaultupdatepolicy_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_preferences_pol_autoupdatecheckperiod",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_preferences_pol_autoupdatecheckperiod_part_autoupdatecheckperiod",
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": 700,
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                }
              }
            ],
            "value": "device_vendor_msft_policy_config_update~policy~cat_google~cat_googleupdate~cat_preferences_pol_autoupdatecheckperiod_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:02:02.5955919Z",
    "settingCount": 4,
    "name": "Edge Update Policy",
    "id": "9d268e55-cd78-49ad-a494-8e55c0b3ef1e",
    "description": "Microsoft Edge update configuration",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:02:02.5955919Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype",
          "choiceSettingValue": {
            "settingValueTemplateReference": {
              "useTemplateDefault": false,
              "settingValueTemplateId": "e5c7c98c-c854-4140-836e-bd22db59d651"
            },
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_windowsadvancedthreatprotection_onboarding_fromconnector",
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "settingValueTemplateReference": null,
                  "valueState": "encryptedValueToken",
                  "value": "b8c68a49-7107-4433-8d93-28eec158bd60",
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationSecretSettingValue"
                }
              }
            ],
            "value": "device_vendor_msft_windowsadvancedthreatprotection_configurationtype_autofromconnector"
          },
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "23ab0ea3-1b12-429a-8ed0-7390cf699160"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-30T14:45:24.0133597Z",
    "settingCount": 1,
    "name": "EDR Policy",
    "id": "3d611942-a5ac-4602-b59c-89be6590b79d",
    "description": "",
    "templateReference": {
      "templateId": "0385b795-0f2f-44ac-8602-9f65bf6adede_1",
      "templateDisplayName": "Endpoint detection and response",
      "templateFamily": "endpointSecurityEndpointDetectionAndResponse",
      "templateDisplayVersion": "Version 1"
    },
    "technologies": "mdm,microsoftSense",
    "platforms": "windows10",
    "createdDateTime": "2025-07-30T14:45:24.0133597Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_requiredeviceencryption",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_bitlocker_requiredeviceencryption_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_allowstandarduserencryption",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_allowstandarduserencryption_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_allowwarningforotherdiskencryption_0"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_bitlocker_configurerecoverypasswordrotation_0"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_7"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_7"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_4"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "5",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_0"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_0"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_0"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_0"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_2"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "6",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_bitlocker_systemdrivesminimumpinlength_0"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "7",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenhancedpin",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_bitlocker_systemdrivesenhancedpin_0"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "8",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_0"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_0"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "9",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "10",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_2"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_0"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "11",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [
                    {
                      "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype",
                      "choiceSettingValue": {
                        "settingValueTemplateReference": null,
                        "children": [
                          {
                            "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name",
                            "choiceSettingValue": {
                              "settingValueTemplateReference": null,
                              "children": [],
                              "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_1"
                            },
                            "settingInstanceTemplateReference": null,
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                          }
                        ],
                        "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1"
                      },
                      "settingInstanceTemplateReference": null,
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
                    }
                  ],
                  "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "12",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              }
            ],
            "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:01:57.8598535Z",
    "settingCount": 13,
    "name": "Enable Bitlocker",
    "id": "1a3999ed-cbc3-461f-b634-cebc78baca7d",
    "description": "Comprehensive BitLocker drive encryption configuration",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:01:57.8598535Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableadministratoraccountstatus",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_enableadministratoraccountstatus_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_localpoliciessecurityoptions_accounts_renameadministratoraccount",
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "simpleSettingValue": {
            "settingValueTemplateReference": null,
            "value": "BLadmin",
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        }
      }
    ],
    "lastModifiedDateTime": "2025-08-01T07:53:09.7292353Z",
    "settingCount": 2,
    "name": "Enable Built-in Administrator Account",
    "id": "b9b3833a-f3ef-4f77-bd60-970622131fc1",
    "description": "Enable and configure built-in administrator account for LAPS",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:02:00.2731308Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_laps_policies_backupdirectory",
          "choiceSettingValue": {
            "settingValueTemplateReference": {
              "useTemplateDefault": false,
              "settingValueTemplateId": "4d90f03d-e14c-43c4-86da-681da96a2f92"
            },
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_laps_policies_passwordagedays_aad",
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": 30,
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
                }
              }
            ],
            "value": "device_vendor_msft_laps_policies_backupdirectory_1"
          },
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "a3270f64-e493-499d-8900-90290f61ed8a"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_laps_policies_administratoraccountname",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "d3d7d492-0019-4f56-96f8-1967f7deabeb"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "simpleSettingValue": {
            "settingValueTemplateReference": {
              "useTemplateDefault": false,
              "settingValueTemplateId": "992c7fce-f9e4-46ab-ac11-e167398859ea"
            },
            "value": "BLadmin",
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
          }
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_laps_policies_passwordcomplexity",
          "choiceSettingValue": {
            "settingValueTemplateReference": {
              "useTemplateDefault": false,
              "settingValueTemplateId": "aa883ab5-625e-4e3b-b830-a37a4bb8ce01"
            },
            "children": [],
            "value": "device_vendor_msft_laps_policies_passwordcomplexity_4"
          },
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "8a7459e8-1d1c-458a-8906-7b27d216de52"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_laps_policies_postauthenticationactions",
          "choiceSettingValue": {
            "settingValueTemplateReference": {
              "useTemplateDefault": false,
              "settingValueTemplateId": "68ff4f78-baa8-4b32-bf3d-5ad5566d8142"
            },
            "children": [],
            "value": "device_vendor_msft_laps_policies_postauthenticationactions_3"
          },
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "d9282eb1-d187-42ae-b366-7081f32dcfff"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-08-01T07:54:12.5837361Z",
    "settingCount": 4,
    "name": "LAPS",
    "id": "c6202ed5-d35f-4e40-9b6e-b1e45152d70b",
    "description": "",
    "templateReference": {
      "templateId": "adc46e5a-f4aa-4ff6-aeff-4f27bc525796_1",
      "templateDisplayName": "Local admin password solution (Windows LAPS)",
      "templateFamily": "endpointSecurityAccountProtection",
      "templateDisplayVersion": "Version 1"
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-08-01T07:54:12.5837361Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_enableautomaticupdates",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_office16v2~policy~l_microsoftofficemachine~l_updates_l_enableautomaticupdates_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:02:03.3112809Z",
    "settingCount": 1,
    "name": "Office Updates Configuration",
    "id": "957a79ae-c39d-46a4-82e4-bec8c32e18e4",
    "description": "Microsoft Office update settings",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:02:03.3112809Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepauseonmeterednetwork_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmblockoptout",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_kfmblockoptout_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_disablepersonalsync_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_forcedlocalmassdeletedetection_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_desktop_checkbox",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_desktop_checkbox_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_documents_checkbox",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_documents_checkbox_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_pictures_checkbox",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_pictures_checkbox_1"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown",
                "choiceSettingValue": {
                  "settingValueTemplateReference": null,
                  "children": [],
                  "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_dropdown_0"
                },
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
              },
              {
                "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_kfmoptinnowizard_textbox",
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                "simpleSettingValue": {
                  "settingValueTemplateReference": null,
                  "value": "",
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                }
              }
            ],
            "value": "device_vendor_msft_policy_config_onedrivengscv2.updates~policy~onedrivengsc_kfmoptinnowizard_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "5",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_silentaccountconfig_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "6",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_filesondemandenabled_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:09:55.0745312Z",
    "settingCount": 7,
    "name": "OneDrive Configuration",
    "id": "11b263b4-a20b-4234-8098-004ac17c95ba",
    "description": "OneDrive for Business configuration with Known Folder Move",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:09:55.0745312Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_languagesettings~l_other_l_disablecomingsoon",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "user_vendor_msft_policy_config_office16v2~policy~l_microsoftofficesystem~l_languagesettings~l_other_l_disablecomingsoon_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_delegates_l_cacheothersmail",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "user_vendor_msft_policy_config_outlk16v2~policy~l_microsoftofficeoutlook~l_outlookoptions~l_delegates_l_cacheothersmail_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_enableallocsiclients",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_enableallocsiclients_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-08-01T08:01:24.9358298Z",
    "settingCount": 3,
    "name": "Outlook Configuration",
    "id": "5320f4b0-6960-45f1-94ee-4193f4a6c9ca",
    "description": "",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-08-01T08:01:24.9358298Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_power_allowhibernate",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_power_allowhibernate_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_power_selectlidcloseactiononbattery",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_power_selectlidcloseactiononbattery_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_power_selectlidcloseactionpluggedin",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_power_selectlidcloseactionpluggedin_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_power_selectpowerbuttonactiononbattery",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_power_selectpowerbuttonactiononbattery_0"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_power_selectpowerbuttonactionpluggedin",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_power_selectpowerbuttonactionpluggedin_0"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "5",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_power_unattendedsleeptimeoutpluggedin",
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
          "simpleSettingValue": {
            "settingValueTemplateReference": null,
            "value": 900,
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
          }
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:09:55.6757417Z",
    "settingCount": 6,
    "name": "Power Options",
    "id": "65b1702e-7720-4155-a8cc-df89e7950949",
    "description": "Comprehensive power management settings for devices",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:09:55.6757417Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_experience_allowmanualmdmunenrollment",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_experience_allowmanualmdmunenrollment_0"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:02:01.1163096Z",
    "settingCount": 1,
    "name": "Prevent Users From Unenrolling Devices",
    "id": "89d01b1b-14cf-4bc3-8d15-24aee6fc3a11",
    "description": "Prevent users from manually unenrolling devices from Intune",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:02:01.1163096Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_automountteamsites",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [
              {
                "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_automountteamsites_automountteamsiteslistbox",
                "groupSettingCollectionValue": [
                  {
                    "children": [
                      {
                        "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_automountteamsites_automountteamsiteslistbox_key",
                        "settingInstanceTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "simpleSettingValue": {
                          "settingValueTemplateReference": null,
                          "value": "Site Name",
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                        }
                      },
                      {
                        "settingDefinitionId": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_automountteamsites_automountteamsiteslistbox_value",
                        "settingInstanceTemplateReference": null,
                        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
                        "simpleSettingValue": {
                          "settingValueTemplateReference": null,
                          "value": "tenantId=",
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                        }
                      }
                    ],
                    "settingValueTemplateReference": null
                  }
                ],
                "settingInstanceTemplateReference": null,
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance"
              }
            ],
            "value": "user_vendor_msft_policy_config_onedrivengscv2~policy~onedrivengsc_automountteamsites_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-08-01T08:08:34.8046882Z",
    "settingCount": 1,
    "name": "Sharepoint File Sync",
    "id": "31bf8d22-ee23-4f45-b8ff-6a2ec5dac928",
    "description": "",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-08-01T08:05:35.0751478Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_systemservices_configurexboxaccessorymanagementservicestartupmode_4"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_systemservices_configurexboxliveauthmanagerservicestartupmode_4"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_systemservices_configurexboxlivegamesaveservicestartupmode_4"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_systemservices_configurexboxlivenetworkingservicestartupmode_4"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-08-01T07:56:24.3280618Z",
    "settingCount": 4,
    "name": "System Services",
    "id": "6fed93c2-dd9f-4244-9d40-3671bb2b5ba7",
    "description": "",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-08-01T07:56:24.3280618Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "vendor_msft_defender_configuration_tamperprotection_options",
          "choiceSettingValue": {
            "settingValueTemplateReference": {
              "useTemplateDefault": false,
              "settingValueTemplateId": "fc365da9-2c1b-4f79-aa4b-dedca69e728f"
            },
            "children": [],
            "value": "vendor_msft_defender_configuration_tamperprotection_options_0"
          },
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "5655cab2-7e6b-4c49-9ce2-3865da05f7e6"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T10:01:57.1572004Z",
    "settingCount": 1,
    "name": "Tamper Protection",
    "id": "700c56b2-d4bf-49d3-ab7c-4d8f54b3ff69",
    "description": "Windows Security tamper protection configuration",
    "templateReference": {
      "templateId": "d948ff9b-99cb-4ee0-8012-1fbc09685377_1",
      "templateDisplayName": "Windows Security Experience",
      "templateFamily": "endpointSecurityAntivirus",
      "templateDisplayVersion": "Version 1"
    },
    "technologies": "mdm,microsoftSense",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T10:01:57.1572004Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_authentication_enablewebsignin",
          "choiceSettingValue": {
            "settingValueTemplateReference": null,
            "children": [],
            "value": "device_vendor_msft_policy_config_authentication_enablewebsignin_1"
          },
          "settingInstanceTemplateReference": null,
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-07-29T14:15:12.976554Z",
    "settingCount": 1,
    "name": "Web Sign-in Policy",
    "id": "3ac3cdca-0860-4569-a581-6aad5792c442",
    "description": "Allows for Sign in with Temp Pass",
    "templateReference": {
      "templateId": "",
      "templateDisplayName": null,
      "templateFamily": "none",
      "templateDisplayVersion": null
    },
    "technologies": "mdm",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T14:15:12.976554Z"
  },
  {
    "settings": [
      {
        "id": "0",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_puaprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "c0135c2a-f802-44f4-9b71-b0b976411b8c"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_puaprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "2d790211-18cb-4e32-b8cc-97407e2c0b45",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "1",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudblocklevel",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "c7a37009-c16e-4145-84c8-89a8c121fb15"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_2",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "517b4e84-e933-42b9-b92f-00e640b1a82d",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "2",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudextendedtimeout",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f61c2788-14e4-4e80-a5a7-bf2ff5052f63"
          },
          "simpleSettingValue": {
            "value": 50,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "608f1561-b603-46bd-bf5f-0b9872002f75",
              "useTemplateDefault": false
            },
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
        }
      },
      {
        "id": "3",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f53ab20e-8af6-48f5-9fa1-46863e1e517e"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ee58fb51-9ae5-408b-9406-b92b643f388a",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "4",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f0790e28-9231-4d37-8f44-84bb47ca1b3e"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0492c452-1069-4b91-9363-93b8e006ab12",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "5",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulescanday",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "087d3362-7e78-4983-96bc-1f4ea183f0e4"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_schedulescanday_2",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "7f4d9dda-6d48-4353-90ca-9fa7164c7215",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "6",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulequickscantime",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "784a4af1-33fa-45f2-b945-138b7ff3bcb6"
          },
          "simpleSettingValue": {
            "value": 720,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "5d5c55c8-1a4e-4272-830d-8dc64cd3ac03",
              "useTemplateDefault": false
            },
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
        }
      },
      {
        "id": "7",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_scanparameter",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "27ca2652-46f3-4cc7-83f2-bf85ff722d84"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_scanparameter_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "70c8f42e-ee6a-4ef1-a070-cb0e9d472581",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "8",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowarchivescanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "7c5c9cde-f74d-4d11-904f-de4c27f72d89"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "9ead75d4-6f30-4bc5-8cc5-ab0f999d79f0",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "9",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablelowcpupriority",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "cdeb96cf-18f5-4477-a710-0ea9ecc618af"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_enablelowcpupriority_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "045a4a13-deee-4e24-9fe4-985c9357680d",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "10",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_disablecatchupfullscan",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f881b08c-f047-40d2-b7d9-3dde7ce9ef64"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_disablecatchupfullscan_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "1b26092f-48c4-447b-99d4-e9c501542f1c",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "11",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_disablecatchupquickscan",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "dabf6781-9d5d-42da-822a-d4327aa2bdd1"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_disablecatchupquickscan_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "d263ced7-0d23-4095-9326-99c8b3f5d35b",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "12",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_avgcpuloadfactor",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "816cc03e-8f96-4cba-b14f-2658d031a79a"
          },
          "simpleSettingValue": {
            "value": 50,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "37195fb1-3743-4c8e-a0ce-b6fae6fa3acd",
              "useTemplateDefault": false
            },
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
        }
      },
      {
        "id": "13",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowuseruiaccess",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "0170a900-b0bc-4ccc-b7ce-dda9be49189b"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowuseruiaccess_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "4b6c9739-4449-4006-8e5f-3049136470ea",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "14",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowcloudprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "7da139f1-9b7e-407d-853a-c2e5037cdc70"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "16fe8afd-67be-4c50-8619-d535451a500c",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "15",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_realtimescandirection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f5ff00a4-e5c7-44cf-a650-9c7619ff1561"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_realtimescandirection_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "6b4e3497-cfbb-4761-a152-de935bbf3f07",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "16",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "8eef615a-1aa0-46f4-a25a-12cbe65de5ab"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "905921da-95e2-4a10-9e30-fe5540002ce1",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "17",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowioavprotection",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "fa06231d-aed4-4601-b631-3a37e85b62a0"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "df4e6cbd-f7ff-41c8-88cd-fa25264a237e",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "18",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscriptscanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "000cf176-949c-4c08-a5d4-90ed43718db7"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "ab9e4320-c953-4067-ac9a-be2becd06b4a",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "19",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "f8f28442-0a6b-4b52-b42c-d31d9687c1cf"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "7b8c858c-a17d-4623-9e20-f34b851670ce",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "20",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowemailscanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "b0d9ee81-de6a-4750-86d7-9397961c9852"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowemailscanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "fdf107fd-e13b-4507-9d8f-db4d93476af9",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "21",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_daystoretaincleanedmalware",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "6f6d741c-1186-42e2-b2f2-8582febcfd60"
          },
          "simpleSettingValue": {
            "value": 0,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "214b6feb-c9b2-4a17-af54-d51c805473e4",
              "useTemplateDefault": false
            },
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
        }
      },
      {
        "id": "22",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_submitsamplesconsent",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "bc47ce7d-a251-4cae-a8a2-6e8384904ab7"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "826ed4b6-e04f-4975-9d23-6f0904b0d87e",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "23",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "dac47505-f072-48d6-9f23-8d93262d58ed"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowfullscanonmappednetworkdrives_0",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "3e920b10-3773-4ac5-957e-e5573aec6d04",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "24",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "fb36e70b-5bc9-488a-a949-8ea3ac1634d5"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "366c5727-629b-4a81-b50b-52f90282fa2c",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "25",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "4fea56e3-7bb6-4ad3-88c6-e364dd2f97b9"
          },
          "choiceSettingValue": {
            "value": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1",
            "settingValueTemplateReference": {
              "settingValueTemplateId": "010779d1-edd4-441d-8034-89ad57a863fe",
              "useTemplateDefault": false
            },
            "children": []
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance"
        }
      },
      {
        "id": "26",
        "settingInstance": {
          "settingDefinitionId": "device_vendor_msft_policy_config_defender_signatureupdateinterval",
          "settingInstanceTemplateReference": {
            "settingInstanceTemplateId": "89879f27-6b7d-44d4-a08e-0a0de3e9663d"
          },
          "simpleSettingValue": {
            "value": 4,
            "settingValueTemplateReference": {
              "settingValueTemplateId": "0af6bbed-a74a-4d08-8587-b16b10b774cb",
              "useTemplateDefault": false
            },
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue"
          },
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance"
        }
      }
    ],
    "lastModifiedDateTime": "2025-08-01T14:59:02.908149Z",
    "settingCount": 27,
    "name": "NGP Windows Default Policy",
    "id": "1bf05953-da80-467c-b114-2d76c7b924c6",
    "description": "Default policy sets settings for all endpoints that are not governed by any other policy, ensuring that all your clients are managed as soon as MDE is deployed. The default policy is based on a set of pre-configured recommended settings and can be adjusted by user with admin priviledges.",
    "templateReference": {
      "templateId": "804339ad-1553-4478-a742-138fb5807418_1",
      "templateDisplayName": "Microsoft Defender Antivirus",
      "templateFamily": "endpointSecurityAntivirus",
      "templateDisplayVersion": "Version 1"
    },
    "technologies": "mdm,microsoftSense",
    "platforms": "windows10",
    "createdDateTime": "2025-07-29T09:11:39.4155062Z"
  }
]
          