[
  {
    "@odata.type": "#microsoft.graph.androidCompliancePolicy",
    "displayName": "Android Basic Compliance",
    "description": "Basic compliance requirements for Android devices",
    "passwordRequired": true,
    "passwordMinimumLength": 6,
    "passwordRequiredType": "alphanumeric",
    "passwordMinutesOfInactivityBeforeLock": 15,
    "passwordExpirationDays": 90,
    "passwordPreviousPasswordBlockCount": 5,
    "storageRequireEncryption": true,
    "securityBlockJailbrokenDevices": true,
    "osMinimumVersion": "8.0",
    "osMaximumVersion": null,
    "minAndroidSecurityPatchLevel": "2023-01-01",
    "securityPreventInstallAppsFromUnknownSources": true,
    "securityDisableUsbDebugging": true,
    "securityRequireVerifyApps": true,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
    "securityRequireGooglePlayServices": false,
    "securityRequireUpToDateSecurityProviders": false,
    "securityRequireSafetyNetAttestationBasicIntegrity": false,
    "securityRequireSafetyNetAttestationCertifiedDevice": false,
    "securityRequireCompanyPortalAppIntegrity": false,
    "securityBlockDeviceAdministratorManagedDevices": false,
    "requiredPasswordComplexity": "none",
    "passwordSignInFailureCountBeforeFactoryReset": null,
    "restrictedApps": [],
    "roleScopeTagIds": ["0"]
  },
  {
    "@odata.type": "#microsoft.graph.iosCompliancePolicy", 
    "displayName": "iOS Basic Compliance",
    "description": "Basic compliance requirements for iOS devices",
    "passcodeRequired": true,
    "passcodeMinimumLength": 6,
    "passcodeRequiredType": "alphanumeric",
    "passcodeMinimumCharacterSetCount": 3,
    "passcodeMinutesOfInactivityBeforeLock": 15,
    "passcodeExpirationDays": 90,
    "passcodePreviousPasscodeBlockCount": 5,
    "passcodeBlockSimple": true,
    "osMinimumVersion": "15.0",
    "osMaximumVersion": null,
    "osMinimumBuildVersion": null,
    "osMaximumBuildVersion": null,
    "securityBlockJailbrokenDevices": true,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
    "managedEmailProfileRequired": false,
    "passcodeMinutesOfInactivityBeforeScreenTimeout": null,
    "restrictedApps": [],
    "roleScopeTagIds": ["0"]
  },
  {
    "@odata.type": "#microsoft.graph.macOSCompliancePolicy",
    "displayName": "macOS Basic Compliance", 
    "description": "Basic compliance requirements for macOS devices",
    "passwordRequired": true,
    "passwordMinimumLength": 8,
    "passwordRequiredType": "alphanumeric",
    "passwordMinimumCharacterSetCount": 3,
    "passwordMinutesOfInactivityBeforeLock": 15,
    "passwordExpirationDays": 90,
    "passwordPreviousPasswordBlockCount": 5,
    "passwordBlockSimple": true,
    "osMinimumVersion": "12.0",
    "osMaximumVersion": null,
    "osMinimumBuildVersion": null,
    "osMaximumBuildVersion": null,
    "systemIntegrityProtectionEnabled": true,
    "storageRequireEncryption": true,
    "firewallEnabled": true,
    "firewallBlockAllIncoming": false,
    "firewallEnableStealthMode": true,
    "gatekeeperAllowedAppSource": "notConfigured",
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "advancedThreatProtectionRequiredSecurityLevel": "unavailable",
    "roleScopeTagIds": ["0"]
  },
  {
    "@odata.type": "#microsoft.graph.windows10CompliancePolicy",
    "displayName": "Windows 10/11 Basic Compliance",
    "description": "Basic compliance requirements for Windows 10/11 devices (no MDE required)",
    "passwordRequired": true,
    "passwordMinimumLength": 8,
    "passwordRequiredType": "alphanumeric", 
    "passwordMinimumCharacterSetCount": null,
    "passwordMinutesOfInactivityBeforeLock": 15,
    "passwordExpirationDays": 90,
    "passwordPreviousPasswordBlockCount": 5,
    "passwordRequiredToUnlockFromIdle": false,
    "passwordBlockSimple": true,
    "osMinimumVersion": "10.0.18362",
    "osMaximumVersion": null,
    "mobileOsMinimumVersion": null,
    "mobileOsMaximumVersion": null,
    "validOperatingSystemBuildRanges": [],
    "bitLockerEnabled": true,
    "storageRequireEncryption": true,
    "activeFirewallRequired": false,
    "defenderEnabled": false,
    "defenderVersion": null,
    "signatureOutOfDate": false,
    "rtpEnabled": false,
    "antivirusRequired": false,
    "antiSpywareRequired": false,
    "deviceThreatProtectionEnabled": false,
    "deviceThreatProtectionRequiredSecurityLevel": "unavailable",
    "configurationManagerComplianceRequired": false,
    "tpmRequired": false,
    "deviceCompliancePolicyScript": null,
    "secureBootEnabled": false,
    "codeIntegrityEnabled": false,
    "memoryIntegrityEnabled": false,
    "virtualizationBasedSecurityEnabled": false,
    "firmwareProtectionEnabled": false,
    "kernelDmaProtectionEnabled": false,
    "earlyLaunchAntiMalwareDriverEnabled": false,
    "requireHealthyDeviceReport": false,
    "wslDistributions": [],
    "roleScopeTagIds": ["0"]
  }
]